{
    "Admin Big Data": "Manages big data platforms and clusters, ensuring data pipelines are efficient, scalable, and secure.",
    "Ansible Automation Engineer": "Develops and maintains Ansible playbooks for automating infrastructure deployment and configuration.",
    "Ansible Operations Engineer": "Handles daily automation tasks and operations using Ansible for system configurations and updates.",
    "AppDynamics Engineer": "Implements and manages AppDynamics APM tools for monitoring application performance and detecting issues.",
    "Application Security Engineer": "Ensures applications are secure through risk assessments, code reviews, and implementing security controls.",
    "Artifactory Administrator": "Manages artifact repositories using JFrog Artifactory, configuring access, cleanup, and storage.",
    "Artifactory Engineer": "Implements and maintains Artifactory for storing build artifacts and integrating with CI/CD pipelines.",
    "Artificial Intelligence Architect": "Designs AI solutions and infrastructure, choosing algorithms and technologies for business goals.",
    "Artificial Intelligence Researcher": "Conducts research in AI domains such as NLP, computer vision, or reinforcement learning to advance technology.",
    "Big Data Architect": "Designs scalable big data solutions, choosing appropriate tools for storage, processing, and analysis.",
    "Big Data Engineer": "Develops data pipelines and processes large-scale data using Hadoop, Spark, or similar technologies.",
    "Big Data Specialist": "Focuses on managing and analyzing massive datasets, optimizing data workflows and ensuring data quality.",
    "Build and Release Engineer": "Automates software builds and manages releases, ensuring version control and deployment accuracy.",
    "Build Engineer": "Creates and manages build systems, integrating source control, testing, and deployment tools.",
    "Chef InSpec Engineer": "Uses InSpec to write infrastructure tests ensuring systems comply with security and configuration policies.",
    "Chef Operations Engineer": "Implements Chef scripts and manages configurations for infrastructure automation and compliance.",
    "Cloud Administrator": "Manages cloud services, ensuring uptime, scalability, and performance of hosted applications.",
    "Cloud automation engineer": "Automates provisioning and configuration of cloud resources using tools like Terraform or Ansible.",
    "Cloud engineer": "Designs and maintains cloud infrastructure, ensuring efficient operation and cost optimization.",
    "Cloud Security Engineer": "Implements and monitors security controls in cloud environments to protect against threats.",
    "CNC Programmer": "Creates code to control CNC machines for manufacturing processes, ensuring precision and efficiency.",
    "Coder": "Writes and maintains code for various software projects across platforms and languages.",
    "Computer Programmer": "Translates specifications into code and debugs programs for various applications.",
    "Developer": "Designs, writes, tests, and maintains software applications.",
    "Computer Graphics Animator": "Creates animations and visual effects for media using computer graphics software.",
    "Computer Hardware Engineer": "Designs and tests computer hardware like processors, circuit boards, and memory devices.",
    "Computer Network Architect": "Designs and builds data communication networks including LANs, WANs, and intranets.",
    "Computer Research Scientist": "Explores and develops new computing technologies and theories.",
    "Computer Systems Analyst": "Analyzes system requirements and recommends IT solutions for business problems.",
    "Confluence Engineer": "Manages Atlassian Confluence spaces, permissions, and integrations for knowledge sharing.",
    "Consul Engineer": "Implements Consul for service discovery, configuration, and network segmentation in microservices.",
    "Coverage.py Engineer": "Uses Coverage.py to measure Python code coverage and ensure adequate testing.",
    "Data Analyst": "Interprets data to provide insights and support business decision-making.",
    "Data Architect": "Designs data models, schemas, and storage solutions for efficient data management.",
    "Data Engineer": "Builds and optimizes data pipelines for ETL processes and large-scale data movement.",
    "Data Modeler": "Creates conceptual, logical, and physical data models to structure and organize data.",
    "Data Scientist": "Applies statistical and machine learning techniques to extract insights from complex data.",
    "Database Administrator": "Manages and maintains databases, ensuring performance, security, and availability.",
    "Datadog Engineer": "Implements Datadog for monitoring infrastructure and applications, setting up dashboards and alerts.",
    "DevOps Architect": "Designs DevOps strategies and tooling for CI/CD, infrastructure as code, and automation.",
    "DevOps Engineer": "Builds and maintains CI/CD pipelines, automation scripts, and monitors deployments.",
    "DevSecOps Architect": "Integrates security into DevOps workflows by embedding controls early in the pipeline.",
    "DevSecOps Engineer": "Implements security automation tools and practices within CI/CD and infrastructure code.",
    "Docker Engineer": "Develops and manages containerized applications using Docker and Docker Compose.",
    "ELK Engineer": "Configures the ELK stack (Elasticsearch, Logstash, Kibana) for log collection, search, and visualization.",
    "Embedded Software Engineer": "Programs low-level software for hardware devices, ensuring functionality and performance.",
    "Entry Level Developer": "Assists in coding and debugging simple features under guidance, gaining experience.",
    "Entry Level Programmer": "Performs basic coding tasks and learns development practices on live projects.",
    "Entry Level Software Developer": "Supports the development of applications under supervision, gaining experience in coding, debugging, and version control systems.",
    "Entry Level Software Engineer": "Participates in the design, development, and testing of software systems while learning engineering best practices.",
    "Jr Developer": "Assists in writing clean and efficient code, fixing bugs, and collaborating with the team to deliver software features.",
    "Junior Developer": "Works on minor features, debugging tasks, and gains practical experience in the software development lifecycle.",
    "Entry Level Network Engineer": "Supports the setup, maintenance, and monitoring of network systems, resolving basic connectivity and performance issues.",
    "Entry Level Web Developer": "Builds and maintains basic web pages or features, often using HTML, CSS, and JavaScript, under guidance.",
    "Junior Web Developer": "Contributes to front-end or back-end website development, maintaining and updating existing components.",
    "Envoy Engineer": "Implements Envoy proxy for service mesh, traffic routing, observability, and security in distributed applications.",
    "Falco Engineer": "Configures and deploys Falco to monitor container and host runtime security events in real-time.",
    "FluentD Engineer": "Implements log collection and aggregation using FluentD to centralize logging infrastructure in cloud-native systems.",
    "Fortify Engineer": "Uses Fortify to analyze source code and detect security vulnerabilities before deployment.",
    "Frameworks Specialist": "Expert in integrating and managing software frameworks across development stacks.",
    "Front End Developer": "Builds interactive UI using HTML, CSS, and JavaScript with frameworks like React, Angular, or Vue.",
    "Front End Web Developer": "Focuses on the client-side of web applications, ensuring a responsive and accessible UI.",
    "Full Stack Developer": "Works on both frontend and backend technologies to build complete web applications.",
    "Full Stack JAVA Developer": "Develops frontend and backend of applications using Java and related frameworks like Spring.",
    "Full Stack JAVA Programmer": "Writes and manages Java-based applications across the full technology stack.",
    "Full Stack JAVA Engineer": "Builds scalable full-stack Java applications and integrates databases and services.",
    "Full Stack Python Developer": "Uses Python frameworks like Django or Flask along with frontend technologies to build web apps.",
    "Full Stack Python Programmer": "Develops complete Python-based applications across server and client-side technologies.",
    "Full Stack Python Engineer": "Implements robust Python backends and dynamic frontends for seamless user experiences.",
    "Game Developer": "Designs and builds video games using engines like Unity or Unreal, focusing on gameplay and graphics.",
    "GCP DevOps Engineer": "Implements CI/CD and infrastructure automation on Google Cloud Platform environments.",
    "Gerrit Administrator": "Manages code review workflows using Gerrit and integrates it with version control systems.",
    "Gerrit Engineer": "Configures Gerrit for efficient code review, collaboration, and version control.",
    "Git Engineer": "Manages source control using Git, ensuring effective branching, merging, and release strategies.",
    "Github Engineer": "Automates CI/CD workflows and version control using GitHub Actions and related tools.",
    "GitLab Engineer": "Uses GitLab CI/CD pipelines to automate testing, building, and deploying software applications.",
    "Gradle Engineer": "Creates and maintains build scripts using Gradle for Java and Android applications.",
    "Grafana Engineer": "Implements Grafana dashboards for system monitoring and visualizing time-series data.",
    "Groovy Engineer": "Develops automation scripts and Jenkins pipelines using the Groovy language.",
    "Information Architect": "Structures digital content and systems for easy navigation, accessibility, and usability.",
    "Information Security Analyst": "Monitors and protects systems from cyber threats, enforcing security policies and incident responses.",
    "Interaction Designer": "Designs user interactions for web and mobile applications focusing on usability and accessibility.",
    "IOS Developer": "Builds mobile applications for Apple devices using Swift or Objective-C.",
    "Junior IOS Developer": "Supports the development of iOS apps under the guidance of senior developers.",
    "Istio Engineer": "Implements Istio for service mesh features like traffic control, observability, and security in microservices.",
    "JaCoCO Engineer": "Uses JaCoCo to measure Java code coverage and improve testing effectiveness.",
    "Java Developer": "Writes Java applications for web, enterprise, or desktop platforms using frameworks like Spring or Hibernate.",
    "JavaScript Developer": "Builds dynamic websites and applications using JavaScript and modern frontend frameworks.",
    "Jenkins Engineer": "Configures Jenkins pipelines to automate code integration, testing, and deployment workflows.",
    "JIRA Administrator": "Manages JIRA projects, workflows, permissions, and integrations for agile teams.",
    "JIRA Engineer": "Customizes JIRA for project tracking and integrates with CI/CD pipelines and developer tools.",
    "Kubernetes Administrator": "Manages Kubernetes clusters for container orchestration, resource scaling, and health monitoring.",
    "Kubernetes Engineer": "Builds and deploys applications on Kubernetes, optimizing workloads and ensuring reliability.",
    "Kubernetes Operations Engineer": "Ensures high availability and performance of Kubernetes environments through monitoring and automation.",
    "Machine Learning Architect": "Designs scalable architectures for deploying machine learning models, including data pipelines, model training infrastructure, and APIs.",
    "Machine Learning Engineer": "Builds, trains, and deploys machine learning models into production environments, ensuring scalability and performance.",
    "Mobile App Developer": "Creates mobile applications for Android or iOS platforms using technologies like Swift, Kotlin, Flutter, or React Native.",
    "Mobile Application Developer": "Develops and maintains apps for smartphones and tablets, ensuring compatibility, responsiveness, and performance.",
    "Mulesoft Developer": "Builds and maintains APIs and integrations using Mulesoft Anypoint Platform to connect systems and data sources.",
    "Nagios Engineer": "Implements and manages Nagios monitoring systems to track system health, service status, and generate alerts.",
    "Network and Systems Administrator": "Manages IT infrastructure including network devices, servers, and system configurations for security and availability.",
    "Network Engineer": "Designs, configures, and troubleshoots networking systems including switches, routers, firewalls, and VPNs.",
    "New Relic Engineer": "Implements New Relic for application performance monitoring, dashboards, and alerting for distributed systems.",
    "Nexus Engineer": "Manages Nexus Repository Manager for storing and distributing build artifacts and dependencies.",
    "Nomad Engineer": "Deploys and maintains HashiCorp Nomad clusters for scheduling and orchestrating containerized and legacy workloads.",
    "Notary Engineer": "Implements Docker Content Trust with Notary to secure container image integrity and provenance.",
    "Octopus Deploy Engineer": "Uses Octopus Deploy to manage automated software deployments across various environments.",
    "OpenShift Engineer": "Implements and supports Red Hat OpenShift clusters for container orchestration and application platform management.",
    "OpenStack Engineer": "Deploys and maintains OpenStack private cloud infrastructure, including compute, networking, and storage services.",
    "Operations Engineer": "Monitors and maintains system operations, automation scripts, and incident response processes.",
    "Oracle Developer": "Develops PL/SQL applications, procedures, and triggers for Oracle databases and enterprise systems.",
    "Oracle SQL Developer": "Designs and writes complex queries, stored procedures, and scripts for Oracle databases using SQL and PL/SQL.",
    "Packer Engineer": "Creates automated machine images using HashiCorp Packer for consistent and repeatable deployments.",
    "PHP Developer": "Develops server-side web applications using PHP and related frameworks like Laravel or CodeIgniter.",
    "Powershell Engineer": "Automates administrative tasks on Windows systems using PowerShell scripts and modules.",
    "Production Support Engineer": "Monitors live systems, handles incidents, and ensures smooth functioning of production applications.",
    "Programmer Analyst": "Combines programming skills and system analysis to design and implement software solutions based on user requirements.",
    "Prometheus Engineer": "Implements Prometheus for metrics collection, monitoring, and alerting across systems and services.",
    "Puppet Engineer": "Uses Puppet to automate infrastructure provisioning, configuration management, and compliance enforcement.",
    "Puppet Operations Engineer": "Maintains and extends Puppet modules for operational automation and consistency across environments.",
    "PyTest Engineer": "Writes automated tests for Python applications using PyTest to ensure code quality and reliability.",
    "Python Developer": "Develops applications, scripts, or backend systems using Python, often with frameworks like Django or Flask.",
    "QA Engineer": "Designs and executes manual and automated test cases to ensure the quality and functionality of software products.",
    "React Developer": "Builds dynamic user interfaces using React.js, managing state, components, and performance optimization.",
    "Robotics Engineer": "Designs and programs robotic systems for automation, manufacturing, or exploration tasks.",
    "Ruby on Rails Developer": "Develops web applications using Ruby on Rails framework, focusing on rapid development and clean code.",
    "Salesforce Developer": "Builds and customizes CRM applications using Salesforce technologies like Apex, Visualforce, and Lightning components.",
    "Search Engine Optimization": "Optimizes website content, structure, and backlinks to improve visibility and ranking on search engines.",
    "Security Engineer": "Implements tools and processes to secure systems, applications, and networks against cyber threats.",
    "Security Specialist": "Analyzes risks, enforces policies, and responds to incidents to maintain IT system security.",
    "Selenium Engineer": "Automates web application testing using Selenium WebDriver to improve test coverage and accuracy.",
    "Site Reliability Engineer (Kubernetes – Docker)": "Maintains high availability of services running on Kubernetes and Docker, combining software engineering with operations.",
    "Splunk Engineer": "Implements Splunk for centralized log analysis, monitoring, alerting, and dashboard creation.",
    "SQL Developer": "Writes and optimizes SQL queries for data retrieval, reporting, and database manipulation.",
    "Systems Administrator": "Manages and maintains servers, operating systems, and IT infrastructure components for performance and uptime.",
    "Systems Engineer": "Designs and integrates complex IT systems and ensures they operate reliably and efficiently.",
    "TeamCity Engineer": "Configures and manages JetBrains TeamCity CI/CD pipelines for automated software build and deployment.",
    "Tech Sales Engineer": "Bridges technical product knowledge and sales, helping customers understand and implement software solutions.",
    "Terraform Engineer": "Creates and manages infrastructure as code using Terraform, automating cloud and on-prem deployments.",
    "TFS Engineer": "Manages source control and DevOps pipelines using Microsoft Team Foundation Server (TFS) or Azure DevOps.",
    "UDeploy Engineer": "Implements IBM UrbanCode Deploy for automating application deployment processes.",
    "UI Designer": "Designs user interface layouts, color schemes, and interactive elements to enhance user experience.",
    "UI Developer": "Implements frontend designs using HTML, CSS, JavaScript, and UI libraries for web or mobile applications.",
    "Unity Developer": "Creates interactive 2D/3D games and simulations using the Unity engine and C# scripting.",
    "UX Designer": "Researches and designs user experiences, focusing on usability, accessibility, and user satisfaction.",
    "Vault Engineer": "Implements and manages HashiCorp Vault for secrets management, encryption, and secure access control.",
    "Web Designer": "Creates visual designs and layouts for websites, focusing on aesthetics, branding, and responsiveness.",
    "Web Designer (UI/UX Designer)": "Designs and prototypes web user interfaces with a focus on both aesthetics and user experience.",
    "Web Developer": "Develops and maintains websites and web applications using client-side and server-side technologies.",
    "WordPress Developer": "Builds and customizes websites using WordPress, including themes, plugins, and site optimization.",
    "XL Deploy Engineer": "Uses XL Deploy to automate application deployments, manage configurations, and orchestrate release processes.",
    "Zabbix Engineer": "Implements and configures Zabbix monitoring tools to track system metrics and send performance alerts."
  }
  